Sources

https://data.cdc.gov/Case-Surveillance/COVID-19-Case-Surveillance-Public-Use-Data/vbim-akqf/about_data
- sex - not one of 'Unknown', 'Missing', 'NA', 'Other'
- age_group - not one of 'Missing', 'NA'
- race_ethnicity_combined - not one of 'Unknown', 'Missing', 'NA'
5.57gb

https://data.cdc.gov/Case-Surveillance/Weekly-United-States-COVID-19-Cases-and-Deaths-by-/pwn4-m3yp/about_data
612kb

COVID-19_Case_Surveillance_Public_Use_Data_20240718.csv
Weekly_United_States_COVID-19_Cases_and_Deaths_by_State_-_ARCHIVED_20240720.csv

In [1]:
import pandas as pd
import numpy as np

In [ ]:
# Load in case data

In [7]:
df = pd.read_csv('COVID-19_Case_Surveillance_Public_Use_Data_20240718.csv')

In [13]:
df = df[['cdc_report_dt', 'sex', 'age_group', 'race_ethnicity_combined',
       'hosp_yn', 'icu_yn', 'death_yn', 'medcond_yn']]

In [ ]:
# Change column names to be more clear

In [49]:
df.columns = ['cdc_report_dt', 'sex', 'age_group', 'race_ethnicity',
       'hospitalized', 'icu', 'death', 'preexisting_medcondition']

In [21]:
len(df)

70699482

In [15]:
df.head(10)

,cdc_report_dt,sex,age_group,race_ethnicity_combined,hosp_yn,icu_yn,death_yn,medcond_yn
0,2022/01/31,Female,20 - 29 Years,"Asian, Non-Hispanic",Missing,Missing,Missing,Missing
1,2020/07/11,Female,20 - 29 Years,"Asian, Non-Hispanic",Unknown,Unknown,Unknown,No
2,2022/09/01,Female,20 - 29 Years,"Asian, Non-Hispanic",Unknown,Missing,No,Missing
3,2023/01/10,Female,20 - 29 Years,"Asian, Non-Hispanic",Unknown,Unknown,Missing,Unknown
4,2020/11/01,Female,20 - 29 Years,"Asian, Non-Hispanic",Unknown,Missing,Unknown,Missing
5,2024/06/24,Female,20 - 29 Years,"Asian, Non-Hispanic",Unknown,Missing,Unknown,Missing
6,2022/10/01,Female,20 - 29 Years,"Asian, Non-Hispanic",Missing,Missing,Missing,Missing
7,2022/07/08,Female,20 - 29 Years,"Asian, Non-Hispanic",No,Missing,Missing,Missing
8,2021/09/08,Female,20 - 29 Years,"Asian, Non-Hispanic",No,Missing,No,Missing
9,2022/01/21,Female,20 - 29 Years,"Asian, Non-Hispanic",No,Unknown,Missing,Yes

In [ ]:
# Get year and month columns, first by removing NaN entries from 'cdc_report_dt'

In [42]:
df = df[df['cdc_report_dt'].notnull()]

In [50]:
len(df)

64742216

In [53]:
def find_year(s):
    return int(s[:4])

def find_month(s):
    months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
    month_number = int(s[5:7])
    return months[month_number-1]

In [58]:
s = '2020/12/11'
find_month(s)

'Dec'

In [56]:
df['year'] = df['cdc_report_dt'].apply(find_year)

In [47]:
df.year.value_counts()

year
2022    26238047
2021    19683940
2020     8068238
2023     6556529
2024     4195462
Name: count, dtype: int64

In [59]:
df['month'] = df['cdc_report_dt'].apply(find_month)

In [60]:
df.month.value_counts()

month
Jan    13167231
Dec     8957556
Feb     5172084
Jun     4839138
Nov     4817261
Sep     4755364
Aug     4543278
Mar     4456841
Oct     3899386
May     3448418
Jul     3357572
Apr     3328087
Name: count, dtype: int64

In [61]:
# save initial file, will slice down more based on what I decide to put on the dashboard
df.to_csv('covid_case_data_20240718_full.csv', index=False)

In [62]:
df.columns

Index(['cdc_report_dt', 'sex', 'age_group', 'race_ethnicity', 'hospitalized',
       'icu', 'death', 'preexisting_medcondition', 'year', 'month'],
      dtype='object')

In [63]:
df.drop(['cdc_report_dt', 'preexisting_medcondition', 'sex'], axis=1, inplace=True)

In [64]:
df.race_ethnicity.value_counts()

race_ethnicity
White, Non-Hispanic                                     36619285
Hispanic/Latino                                         14037786
Black, Non-Hispanic                                      8661469
Asian, Non-Hispanic                                      2446137
Multiple/Other, Non-Hispanic                             2159977
American Indian/Alaska Native, Non-Hispanic               668488
Native Hawaiian/Other Pacific Islander, Non-Hispanic      149074
Name: count, dtype: int64

In [66]:
df.columns

Index(['age_group', 'race_ethnicity', 'hospitalized', 'icu', 'death', 'year',
       'month'],
      dtype='object')

In [67]:
df.describe()

               year
count  6.474222e+07
mean   2.021678e+03
std    1.029106e+00
min    2.020000e+03
25%    2.021000e+03
50%    2.022000e+03
75%    2.022000e+03
max    2.024000e+03

In [68]:
df[['age_group', 'race_ethnicity', 'hospitalized', 'icu', 'death', 'month']].describe()

,age_group,race_ethnicity,hospitalized,icu,death,month
count,64742216,64742216,64742216,64742216,64742216,64742216
unique,9,7,4,4,4,12
top,20 - 29 Years,"White, Non-Hispanic",Missing,Missing,Missing,Jan
freq,10633145,36619285,27136853,54261309,29943644,13167231

In [69]:
# save working file, but it's still too large at 3.9gb
df.to_csv('covid_case_data_20240718.csv', index=False)

In [ ]:
# will try to make the file size smaller by truncating some of the text

In [70]:
df.age_group.value_counts()

age_group
20 - 29 Years    10633145
30 - 39 Years    10337174
40 - 49 Years     8918721
50 - 59 Years     8477923
10 - 19 Years     7433999
60 - 69 Years     6692023
0 - 9 Years       5039122
70 - 79 Years     4293987
80+ Years         2916122
Name: count, dtype: int64

In [77]:
df['age_group'] = df['age_group'].apply(lambda s: s.replace('Years','').replace(' ',''))

In [78]:
df.age_group.value_counts()

age_group
20-29    10633145
30-39    10337174
40-49     8918721
50-59     8477923
10-19     7433999
60-69     6692023
0-9       5039122
70-79     4293987
80+       2916122
Name: count, dtype: int64

In [71]:
df.race_ethnicity.value_counts()

race_ethnicity
White, Non-Hispanic                                     36619285
Hispanic/Latino                                         14037786
Black, Non-Hispanic                                      8661469
Asian, Non-Hispanic                                      2446137
Multiple/Other, Non-Hispanic                             2159977
American Indian/Alaska Native, Non-Hispanic               668488
Native Hawaiian/Other Pacific Islander, Non-Hispanic      149074
Name: count, dtype: int64

In [81]:
df['race_ethnicity'] = df['race_ethnicity'].apply(lambda s: s.replace(', Non-Hispanic', ''))

In [82]:
df.race_ethnicity.value_counts()

race_ethnicity
White                                     36619285
Hispanic/Latino                           14037786
Black                                      8661469
Asian                                      2446137
Multiple/Other                             2159977
American Indian/Alaska Native               668488
Native Hawaiian/Other Pacific Islander      149074
Name: count, dtype: int64

In [87]:
def replace_hospitalized_icu_death_values_to_bool(s):
    if s in ['Missing', 'Unknown']:
        return None
    elif s == 'Yes':
        return True
    else:
        return False

In [72]:
df.hospitalized.value_counts()

hospitalized
Missing    27136853
No         24045526
Unknown    10919379
Yes         2640458
Name: count, dtype: int64

In [73]:
df.icu.value_counts()

icu
Missing    54261309
Unknown     7843555
No          2453810
Yes          183542
Name: count, dtype: int64

In [74]:
df.death.value_counts()

death
Missing    29943644
No         23791233
Unknown    10130814
Yes          876525
Name: count, dtype: int64

In [88]:
df['hospitalized'] = df['hospitalized'].apply(replace_hospitalized_icu_death_values_to_bool)
df['icu'] = df['icu'].apply(replace_hospitalized_icu_death_values_to_bool)
df['death'] = df['death'].apply(replace_hospitalized_icu_death_values_to_bool)

In [89]:
# still 1.8 gb
df.to_csv('covid_case_data_20240718.csv', index=False)

In [ ]:
# removing all values with missing data in the three columns: hospitalized, icu, death

In [90]:
len(df)

64742216

In [92]:
df.hospitalized.value_counts(dropna=False)

hospitalized
None     38056232
False    24045526
True      2640458
Name: count, dtype: int64

In [99]:
df.dropna(axis=0, how='all', subset=['hospitalized','icu','death'], inplace=True)

In [100]:
len(df)

33899452

In [102]:
# 1.1gb...
df.to_csv('covid_case_data_20240718.csv', index=False)

In [ ]:
# since the state dataset only goes from 1/2020-5/2023, we'll remove anything beyond that

df = pd.read_csv('covid_case_data_20240718.csv')

In [120]:
df.head()

  age_group race_ethnicity hospitalized    icu  death  year month
0     20-29          Asian          NaN    NaN  False  2022   Sep
1     20-29          Asian        False    NaN    NaN  2022   Jul
2     20-29          Asian        False    NaN  False  2021   Sep
3     20-29          Asian        False    NaN    NaN  2022   Jan
4     20-29          Asian        False  False  False  2022   Apr

In [121]:
df[df['year']==2023].head(10)

    age_group race_ethnicity hospitalized  icu  death  year month
22      20-29          Asian          NaN  NaN  False  2023   Feb
67      20-29          Asian        False  NaN    NaN  2023   Jun
68      20-29          Asian        False  NaN  False  2023   Mar
72      20-29          Asian        False  NaN  False  2023   Mar
98      20-29          Asian        False  NaN    NaN  2023   Jan
104     20-29          Asian        False  NaN  False  2023   Oct
112     20-29          Asian        False  NaN  False  2023   Feb
137     20-29          Asian        False  NaN  False  2023   Mar
156     20-29          Asian        False  NaN    NaN  2023   Jul
204     20-29          Asian        False  NaN  False  2023   Feb

In [122]:
df.year.value_counts(dropna=False)

year
2021    11784563
2022    11591452
2020     5721495
2023     2971975
2024     1829967
Name: count, dtype: int64

In [123]:
df.drop(df[df['year']==2024].index, inplace=True)

In [124]:
df.year.value_counts(dropna=False)

year
2021    11784563
2022    11591452
2020     5721495
2023     2971975
Name: count, dtype: int64

In [129]:
df2 = df[df['year']==2023]

In [130]:
df2.year.value_counts()

year
2023    2971975
Name: count, dtype: int64

In [139]:
indices = df2[df2['month'].isin(['May','Jun','Jul','Aug','Sep','Oct','Nov','Dec'])].index

In [140]:
indices

Index([      67,      104,      156,      238,      240,      250,      270,
            276,      293,      297,
       ...
       33899234, 33899236, 33899242, 33899249, 33899255, 33899265, 33899301,
       33899303, 33899339, 33899408],
      dtype='int64', length=1481092)

In [144]:
df.drop(indices, inplace=True)

In [145]:
df.year.value_counts(dropna=False)

year
2021    11784563
2022    11591452
2020     5721495
2023     1490883
Name: count, dtype: int64

In [148]:
# 1.05 gb, getting there
df.to_csv('covid_case_data_20240718.csv', index=False)

In [149]:
df.head()

  age_group race_ethnicity hospitalized    icu  death  year month
0     20-29          Asian          NaN    NaN  False  2022   Sep
1     20-29          Asian        False    NaN    NaN  2022   Jul
2     20-29          Asian        False    NaN  False  2021   Sep
3     20-29          Asian        False    NaN    NaN  2022   Jan
4     20-29          Asian        False  False  False  2022   Apr

In [150]:
df.race_ethnicity.value_counts(dropna=False)

race_ethnicity
White                                     18054215
Hispanic/Latino                            6720767
Black                                      3540170
Asian                                      1024434
Multiple/Other                              887909
American Indian/Alaska Native               285824
Native Hawaiian/Other Pacific Islander       75074
Name: count, dtype: int64

In [151]:
len(df)

30588393

In [152]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30588393 entries, 0 to 33899451
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   age_group       object
 1   race_ethnicity  object
 2   hospitalized    object
 3   icu             object
 4   death           object
 5   year            int64
 6   month           object
dtypes: int64(1), object(6)
memory usage: 1.8+ GB

In [153]:
def truncate_race_names(s):
    if s == 'Hispanic/Latino':
        return 'Hispanic'
    elif s in ['Multiple/Other',
               'American Indian/Alaska Native',
               'Native Hawaiian/Other Pacific Islander']:
        return 'Other'
    else:
        return s

In [154]:
df['race_ethnicity'] = df['race_ethnicity'].apply(truncate_race_names)

In [155]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 30588393 entries, 0 to 33899451
Data columns (total 7 columns):
 #   Column          Dtype
---  ------          -----
 0   age_group       object
 1   race_ethnicity  object
 2   hospitalized    object
 3   icu             object
 4   death           object
 5   year            int64
 6   month           object
dtypes: int64(1), object(6)
memory usage: 1.8+ GB

In [156]:
df.race_ethnicity.value_counts(dropna=False)

race_ethnicity
White       18054215
Hispanic     6720767
Black        3540170
Other        1248807
Asian        1024434
Name: count, dtype: int64

In [157]:
df.to_csv('covid_case_data_20240718.csv', index=False)

In [158]:
len(df)

30588393

In [ ]:
# so apparently, i can only have <15mil rows in Tableau public, so we have to reduce more

df = pd.read_csv('covid_case_data_20240718.csv')

In [194]:
df.head()

  age_group race_ethnicity hospitalized    icu  death  year month
0     20-29          Asian          NaN    NaN  False  2022   Sep
1     20-29          Asian        False    NaN    NaN  2022   Jul
2     20-29          Asian        False    NaN  False  2021   Sep
3     20-29          Asian        False    NaN    NaN  2022   Jan
4     20-29          Asian        False  False  False  2022   Apr

In [195]:
df.hospitalized.value_counts(dropna=False)

hospitalized
False    22760128
NaN       5421781
True      2406484
Name: count, dtype: int64

In [196]:
df.icu.value_counts(dropna=False)

icu
NaN      28077272
False     2341428
True       169693
Name: count, dtype: int64

In [197]:
df.death.value_counts(dropna=False)

death
False    20923128
NaN       8852408
True       812857
Name: count, dtype: int64

In [198]:
len(df)

30588393

df2 = df.dropna(subset = ['hospitalized','icu','death'])

len(df2) # all three

In [204]:
df.dropna(subset = ['hospitalized','death'], inplace=True)

In [205]:
len(df) # hos/death

16348900

In [ ]:
# at this point, I'm just going to sample down to sub 15mil

In [208]:
n=14990000
seed=1234
df = df.sample(n, random_state=seed)
len(df)

14990000

In [209]:
df.to_csv('covid_case_data_20240718.csv', index=False)

In [2]:
df = pd.read_csv('covid_case_data_20240718.csv')

In [3]:
len(df)

14990000

In [4]:
df.dropna(subset = ['hospitalized','icu','death'], inplace=True)

In [5]:
len(df)

1738192

In [6]:
df.to_csv('covid_case_data_20240718_reduced.csv', index=False)

In [105]:
# Load in state/time data

In [159]:
df = pd.read_csv('Weekly_United_States_COVID-19_Cases_and_Deaths_by_State_-_ARCHIVED_20240720.csv')

In [160]:
df.head()

,date_updated,state,start_date,end_date,tot_cases,new_cases,tot_deaths,new_deaths,new_historic_cases,new_historic_deaths
0,02/23/2023,AZ,02/16/2023,02/22/2023,2434631,3716,33042,39,23150,0
1,12/22/2022,LA,12/15/2022,12/21/2022,1507707,4041,18345,21,21397,0
2,02/23/2023,GA,02/16/2023,02/22/2023,3061141,5298,42324,88,6800,0
3,03/30/2023,LA,03/23/2023,03/29/2023,1588259,2203,18858,23,5347,0
4,02/02/2023,LA,01/26/2023,02/01/2023,1548508,5725,18572,47,4507,0

In [161]:
# drop unnecessary columns
df.drop(['date_updated', 'end_date', 'tot_cases', 'tot_deaths', 'new_historic_cases', 'new_historic_deaths'], axis=1, inplace=True)

In [162]:
df.head()

  state  start_date  new_cases  new_deaths
0    AZ  02/16/2023       3716          39
1    LA  12/15/2022       4041          21
2    GA  02/16/2023       5298          88
3    LA  03/23/2023       2203          23
4    LA  01/26/2023       5725          47

In [ ]:
# we'll need to convert start_date to year and month columns

In [176]:
def find_year2(s):
    return int(s[6:])

def find_month2(s):
    months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
    month_number = int(s[:2])
    return months[month_number-1]

In [177]:
df['year'] = df['start_date'].apply(find_year2)
df['month'] = df['start_date'].apply(find_month2)

In [179]:
df.drop('start_date', axis=1, inplace=True)

In [180]:
df.head()

  state  new_cases  new_deaths  year month
0    AZ       3716          39  2023   Feb
1    LA       4041          21  2022   Dec
2    GA       5298          88  2023   Feb
3    LA       2203          23  2023   Mar
4    LA       5725          47  2023   Jan

In [185]:
df = (
    df.groupby(['state','year','month'])
        .agg(new_cases=('new_cases', 'sum'), new_deaths=('new_deaths', 'sum'))
)

In [188]:
df.reset_index(inplace=True)

In [189]:
df

     state  year month  new_cases  new_deaths
0       AK  2020   Apr        225           7
1       AK  2020   Aug       1988          13
2       AK  2020   Dec      14012          97
3       AK  2020   Feb          0           0
4       AK  2020   Jan          0           0
...    ...   ...   ...        ...         ...
2455    WY  2023   Apr        542          11
2456    WY  2023   Feb       1156          23
2457    WY  2023   Jan        835          21
2458    WY  2023   Mar       1084          18
2459    WY  2023   May        366           0

[2460 rows x 5 columns]

In [8]:
df = pd.read_csv('covid_state_data_20240720.csv')

In [10]:
def convert_to_year_month_string(y, m):
    months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
    month_num = months.index(m) + 1
    if month_num < 10:
        month_str = '0' + str(month_num)
    else:
        month_str = str(month_num)
    return f'{y}-{month_str}'

In [12]:
convert_to_year_month_string(2020, 'Dec')

'2020-12'

In [13]:
df['year-month'] = df.apply(lambda d: convert_to_year_month_string(d.year, d.month), axis=1)

In [14]:
df

     state  year month  new_cases  new_deaths year-month
0       AK  2020   Apr        225           7    2020-04
1       AK  2020   Aug       1988          13    2020-08
2       AK  2020   Dec      14012          97    2020-12
3       AK  2020   Feb          0           0    2020-02
4       AK  2020   Jan          0           0    2020-01
...    ...   ...   ...        ...         ...        ...
2455    WY  2023   Apr        542          11    2023-04
2456    WY  2023   Feb       1156          23    2023-02
2457    WY  2023   Jan        835          21    2023-01
2458    WY  2023   Mar       1084          18    2023-03
2459    WY  2023   May        366           0    2023-05

[2460 rows x 6 columns]

In [21]:
df.to_csv('covid_state_data_20240720.csv', index=False)

In [22]:
len(df)

2460

In [210]:
months = ['Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'Jul', 'Aug', 'Sep', 'Oct', 'Nov', 'Dec']
month_nums = [1,2,3,4,5,6,7,8,9,10,11,12]
data = {
    'month_index': month_nums,
    'month': months
}
pd.DataFrame(data).to_csv('months.csv', index=False)